# My SQL Preparation for IMDB Project

## Required Transformation steps:
 
#### Normalize Genre:

Convert the single string of genres from title  basics into 2 new tables.

    1. title_genres: with the columns:
            tconst
            genre_id
    2. genres:
            genre_id
            genre_name
            
#### Discard unnecessary information:

For the title basics table, drop the following columns:

- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

Do not include the title_akas table in your SQL database.

- You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.

In [2]:
#import necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import json
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy.types import *
from sqlalchemy_utils import create_database, database_exists

In [3]:
username = 'root'
password ='Sachvin2017'



connection = f'mysql+pymysql://{username}:{password}@localhost/Movies'
engine = create_engine(connection)

In [4]:
## Check if database exists, if not, create it
if database_exists(connection) == False: create_database(connection)
else: print('The database already exists.')

The database already exists.

In [5]:
title_basics_df = pd.read_csv('Data/title_basics.csv.gz')

In [6]:
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

Splitting columns in Genres

In [7]:
title_basics_df['genres_split'] = title_basics_df['genres'].str.split(',')
title_basics_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
80738,tt9914942,movie,Life Without Sara Amat,La vida sense la Sara Amat,0,2019,NaN,74,Drama,[Drama]
80739,tt9915872,movie,The Last White Witch,My Girlfriend is a Wizard,0,2019,NaN,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
80740,tt9916170,movie,The Rehearsal,O Ensaio,0,2019,NaN,51,Drama,[Drama]
80741,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
80742,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History","[Drama, History]"

In [8]:
#Explode to sepreate the list of genres to seperate new rows
exploded_genres_df = title_basics_df.explode('genres_split')
exploded_genres_df

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
80741,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Action
80741,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Adventure
80741,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,90,"Action,Adventure,Thriller",Thriller
80742,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
80742,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History

In [9]:
unique_genres = sorted(exploded_genres_df['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

## Table Creation

New table #title_genre

In [10]:
title_genres = exploded_genres_df[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [11]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres = title_genres.drop(columns='genres_split')
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
80741  tt9916190         0
80741  tt9916190         2
80741  tt9916190        23
80742  tt9916362         7
80742  tt9916362        11

[150667 rows x 2 columns]

In [13]:
#manually make dataframe with named cols from the .keyd and .values
genre = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id': genre_map.values()})
genre.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

## SQL Table creation

### Title_basics table

In [14]:
title_basics_df.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [15]:
title_basics = title_basics_df.drop(columns = ['titleType', 'originalTitle',
                                                  'isAdult', 'endYear', 'genres', 'genres_split'])

In [16]:
title_basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 80743 entries, 0 to 80742
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          80743 non-null  object
 1   primaryTitle    80743 non-null  object
 2   startYear       80743 non-null  int64
 3   runtimeMinutes  80743 non-null  int64
dtypes: int64(2), object(2)
memory usage: 2.5+ MB

In [17]:
title_basics.dtypes

tconst            object
primaryTitle      object
startYear          int64
runtimeMinutes     int64
dtype: object

In [18]:
# Calculate max string lengths for object columns ('tconst' and 'primaryTitle')
key_len = title_basics_df['tconst'].fillna('').map(len).max()
title_len = title_basics_df['primaryTitle'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'tconst': String(key_len+1), 
    'primaryTitle': Text(title_len+1),
    'startYear': Integer(),
    'runtimeMinutes': Integer()}

In [19]:
title_basics.to_sql('title_basics',engine,dtype=df_schema,if_exists='replace',index=False)

In [20]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [21]:
q = """
SELECT * 
FROM title_basics LIMIT 3
;"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122

### title_genres table

In [22]:
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [23]:
title_genres.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 150667 entries, 0 to 80742
Data columns (total 2 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   tconst    150667 non-null  object
 1   genre_id  150667 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.4+ MB

In [24]:
## Calculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'genre_id': Integer()}

In [25]:
#save to sql with dtype and index=false
title_genres.to_sql('title_genres', engine, dtype=df_schema, 
                   if_exists = 'replace', index=False)

In [26]:
q = """
SELECT * 
FROM title_genres LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18

### Genre Table

In [27]:
genre.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 26 entries, 0 to 25
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   genre_name  26 non-null     object
 1   genre_id    26 non-null     int64
dtypes: int64(1), object(1)
memory usage: 544.0+ bytes

In [28]:
## Calculate max string lengths for object columns
key_len = genre['genre_name'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'genre_id': Integer(),
    "genre_name": String(key_len+1) 
    }

In [29]:
#save to sql with dtype and index=false
genre.to_sql('genres', engine, dtype=df_schema,
                   if_exists = 'replace', index=False)

In [30]:
# Use the sqlalchemy engine to update the table and set genre_id as the primary key
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [31]:
q = """
SELECT * 
FROM genres LIMIT 3
;"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2

### Title_ Rating table

In [32]:
title_ratings_df = pd.read_csv('Data/title_ratings.csv.gz')
title_ratings_df.head()

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

In [33]:
title_ratings_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1237680 entries, 0 to 1237679
Data columns (total 3 columns):
 #   Column         Non-Null Count    Dtype
---  ------         --------------    -----
 0   tconst         1237680 non-null  object
 1   averageRating  1237680 non-null  float64
 2   numVotes       1237680 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 28.3+ MB

In [34]:
# Calculate max string lengths for object columns
key_len = title_ratings_df['tconst'].fillna('').map(len).max()

# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    'averageRating':Float(),
    'numVotes':Integer()}

In [35]:
# Save to sql with dtype and index=False
title_ratings_df.to_sql('title_ratings',
              engine, 
              dtype=df_schema,
              if_exists='replace',
              index=False)

In [36]:
# Use the sqlalchemy engine to update the table and set tconst as the primary key
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [37]:
q = """
SELECT * 
FROM title_ratings LIMIT 3
;"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647

### tmdb_data

In [38]:
tmdb_df = pd.read_csv('Data/tmdb_results_combined.csv.gz')
tmdb_df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.4,21.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,4.4,7.0,Not Available
3,tt0116391,0.0,NaN,NaN,0.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",NaN,442869.0,hi,Gang,...,0.0,152.0,"[{'english_name': 'Hindi', 'iso_639_1': 'hi', ...",Released,NaN,Gang,0.0,0.0,0.0,Not Available
4,tt0118694,0.0,/n4GJFGzsc7NinI1VeGDXIcQjtU2.jpg,NaN,150000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10749, 'n...",http://www.wkw-inthemoodforlove.com/,843.0,cn,花樣年華,...,12854953.0,99.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,"Feel the heat, keep the feeling burning, let t...",In the Mood for Love,0.0,8.1,1859.0,Not Available

In [39]:
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2472 non-null   object
 1   adult                  2470 non-null   float64
 2   backdrop_path          1239 non-null   object
 3   belongs_to_collection  192 non-null    object
 4   budget                 2470 non-null   float64
 5   genres                 2470 non-null   object
 6   homepage               171 non-null    object
 7   id                     2470 non-null   float64
 8   original_language      2470 non-null   object
 9   original_title         2470 non-null   object
 10  overview               2417 non-null   object
 11  popularity             2470 non-null   float64
 12  poster_path            2155 non-null   object
 13  production_companies   2470 non-null   object
 14  production_countries   2470 non-null   object
 15  release_date           2448 non-null   object
 16  revenue                2470 non-null   float64
 17  runtime                2424 non-null   float64
 18  spoken_languages       2470 non-null   object
 19  status                 2470 non-null   object
 20  tagline                1019 non-null   object
 21  title                  2470 non-null   object
 22  video                  2470 non-null   float64
 23  vote_average           2470 non-null   float64
 24  vote_count             2470 non-null   float64
 25  certification          1585 non-null   object
dtypes: float64(9), object(17)
memory usage: 502.2+ KB

In [40]:
tmdb_df = tmdb_df.drop(columns = ['adult', 'backdrop_path','belongs_to_collection',
                               'genres', 'homepage', 'id', 'original_language', 
                              'original_title', 'overview', 'popularity', 
                              'poster_path', 'production_companies',
                               'production_countries', 'release_date', 
                              'runtime', 'spoken_languages', 'status', 
                              'tagline', 'title', 'video', 'vote_average', 
                              'vote_count'])
tmdb_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2472 entries, 0 to 2471
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   imdb_id        2472 non-null   object
 1   budget         2470 non-null   float64
 2   revenue        2470 non-null   float64
 3   certification  1585 non-null   object
dtypes: float64(2), object(2)
memory usage: 77.4+ KB

In [41]:
tmdb_df = tmdb_df.iloc[1: , :]

In [42]:
# Calculate max string lengths for object columns ('tconst' and 'primaryTitle')
imdb_id_len = tmdb_df['imdb_id'].fillna('').map(len).max()

certification_len = tmdb_df['certification'].fillna('').map(len).max()



# Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    'imdb_id': String(imdb_id_len+1), 
    'budget':Float(), 
    'revenue':Float(),
    'certification': String(certification_len+1)}

In [43]:
tmdb_df.to_sql('tmdb_data', engine, dtype=df_schema, 
              if_exists='replace', index=False)

In [44]:
# Use the sqlalchemy engine to update the table and set imdb_id as the primary key
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [45]:
q = """
SELECT * 
FROM tmdb_data LIMIT 3
;"""
pd.read_sql(q, engine)

     imdb_id      budget     revenue certification
0          0         NaN         NaN          None
1  tt0035423  48000000.0  76019000.0         PG-13
2  tt0113026  10000000.0         0.0          None

## All SQL tables

In [47]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data